app/Controllers/User/CertificateController.php

SELECT `event_registrations`.*, `events`.`title` as `event_title`, `events`.`start_date` as `event_start_date`, `events`.`end_date` as `event_end_date`, `events`.`speaker` as `event_speaker`, `events`.`type` as `event_type`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
WHERE `event_registrations`.`user_id` = '9'
ORDER BY `event_registrations`.`created_at` DESC
---
    public function index()
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $userId = session()->get('user_id');

        // Get user's certificates (registrations with attended status)
        $certificates = $this->registrationModel
            ->select('event_registrations.*,
                     events.title as event_title,
                     events.start_date as event_start_date,
                     events.end_date as event_end_date,
                     events.speaker as event_speaker,
                     events.type as event_type')
            ->join('events', 'events.id = event_registrations.event_id')
            ->where('event_registrations.user_id', $userId)
            ->orderBy('event_registrations.created_at', 'DESC')
            ->findAll();

SELECT `event_registrations`.*, `events`.`title` as `event_title`, `events`.`start_date` as `event_start_date`, `events`.`end_date` as `event_end_date`, `events`.`speaker` as `event_speaker`, `events`.`type` as `event_type`, `events`.`description` as `event_description`, `users`.`full_name`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
WHERE `event_registrations`.`id` = '6'
AND `event_registrations`.`user_id` = '9'
 LIMIT 1
---
    public function view($registrationId)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $userId = session()->get('user_id');

        // Get registration details
        $registration = $this->registrationModel
            ->select('event_registrations.*,
                     events.title as event_title,
                     events.start_date as event_start_date,
                     events.end_date as event_end_date,
                     events.speaker as event_speaker,
                     events.type as event_type,
                     events.description as event_description,
                     users.full_name')
            ->join('events', 'events.id = event_registrations.event_id')
            ->join('users', 'users.id = event_registrations.user_id')
            ->where('event_registrations.id', $registrationId)
            ->where('event_registrations.user_id', $userId)
            ->first();

SELECT `event_registrations`.*, `events`.`title` as `event_title`, `events`.`start_date` as `event_start_date`, `events`.`end_date` as `event_end_date`, `events`.`speaker` as `event_speaker`, `events`.`type` as `event_type`, `users`.`full_name`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
WHERE `event_registrations`.`id` = '6'
AND `event_registrations`.`user_id` = '9'
 LIMIT 1
---
    public function download($registrationId)
    {
        // Check if user is logged in
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login')->with('error', 'Silakan login terlebih dahulu');
        }

        $userId = session()->get('user_id');

        // Get registration details
        $registration = $this->registrationModel
            ->select('event_registrations.*,
                     events.title as event_title,
                     events.start_date as event_start_date,
                     events.end_date as event_end_date,
                     events.speaker as event_speaker,
                     events.type as event_type,
                     users.full_name')
            ->join('events', 'events.id = event_registrations.event_id')
            ->join('users', 'users.id = event_registrations.user_id')
            ->where('event_registrations.id', $registrationId)
            ->where('event_registrations.user_id', $userId)
            ->first();

SELECT `event_registrations`.*, `events`.`title` as `event_title`, `events`.`start_date` as `event_start_date`, `events`.`end_date` as `event_end_date`, `events`.`speaker` as `event_speaker`, `events`.`type` as `event_type`, `users`.`full_name` as `user_name`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
WHERE `event_registrations`.`certificate_code` = 'CERT-6874325540757'
AND `event_registrations`.`status` = 'attended'
 LIMIT 1
---
    public function verify()
    {
        $certificateCode = $this->request->getPost('certificate_code');

        if (!$certificateCode) {
            // If no code provided, show the verification form
            $data = [
                'title' => 'Verifikasi Sertifikat',
                'certificate' => null
            ];
            return view('user/certificates/verify', $data);
        }

        // Search for certificate by code
        $certificate = $this->registrationModel
            ->select('event_registrations.*,
                     events.title as event_title,
                     events.start_date as event_start_date,
                     events.end_date as event_end_date,
                     events.speaker as event_speaker,
                     events.type as event_type,
                     users.full_name as user_name')
            ->join('events', 'events.id = event_registrations.event_id')
            ->join('users', 'users.id = event_registrations.user_id')
            ->where('event_registrations.certificate_code', $certificateCode)
            ->where('event_registrations.status', 'attended')
            ->first();