app/Controllers/AdminController.php

    public function dashboard()
    {
        $authCheck = $this->checkAdminAuth();
        if ($authCheck) return $authCheck;

        try {
            $eventStats = $this->eventModel->getEventStats();
            $registrationStats = $this->registrationModel->getRegistrationStats();
            $userStats = [
                'total_users' => $this->userModel->countAll(),
                'active_users' => $this->userModel->where('is_active', true)->countAllResults(),
                'admin_users' => $this->userModel->where('role', 'admin')->countAllResults()
            ];

            $recentEvents = $this->eventModel->orderBy('created_at', 'DESC')->limit(5)->findAll();
            $recentRegistrations = $this->registrationModel
                ->select('event_registrations.*, events.title as event_title, users.full_name')
                ->join('events', 'events.id = event_registrations.event_id')
                ->join('users', 'users.id = event_registrations.user_id')
                ->orderBy('event_registrations.created_at', 'DESC')
                ->limit(5)
                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `is_active` = 1
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'admin'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `events`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `event_registrations`.*, `events`.`title` as `event_title`, `users`.`full_name`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
ORDER BY `event_registrations`.`created_at` DESC
 LIMIT 5

    public function events()
    {
        $authCheck = $this->checkAdminAuth();
        if ($authCheck) return $authCheck;

        $events = $this->eventModel
            ->select('events.*, users.full_name as creator_name')
            ->join('users', 'users.id = events.created_by')
            ->orderBy('events.created_at', 'DESC')
            ->findAll();
---
SELECT `events`.*, `users`.`full_name` as `creator_name`
FROM `events`
JOIN `users` ON `users`.`id` = `events`.`created_by`
ORDER BY `events`.`created_at` DESC

    public function users()
    {
        $authCheck = $this->checkAdminAuth();
        if ($authCheck) return $authCheck;

        $cacheService = new \App\Services\CacheService();

        // Get users with additional data
        $users = $this->userModel->orderBy('created_at', 'DESC')->findAll();

        // Add registration counts for each user
        foreach ($users as &$user) {
            $user['total_registrations'] = $this->registrationModel
                ->where('user_id', $user['id'])
                ->countAllResults();
            $user['certificates_count'] = 0; // Placeholder for certificates
        }

        $stats = $cacheService->getUserStats(); // Use cached stats

        // Get recent registrations
        $recent_registrations = $this->registrationModel
            ->select('event_registrations.*, users.full_name as user_name, events.title as event_title')
            ->join('users', 'users.id = event_registrations.user_id')
            ->join('events', 'events.id = event_registrations.event_id')
            ->orderBy('event_registrations.created_at', 'DESC')
            ->limit(5)
            ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
SELECT `event_registrations`.*, `users`.`full_name` as `user_name`, `events`.`title` as `event_title`
FROM `event_registrations`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
ORDER BY `event_registrations`.`created_at` DESC
 LIMIT 5

        $user_growth = [];
        for ($i = 29; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-{$i} days"));
            $count = $this->userModel
                ->where('DATE(created_at)', $date)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE(created_at) = '2025-06-14'
AND `users`.`deleted_at` IS NULL

    public function reports()
    {
        $authCheck = $this->checkAdminAuth();
        if ($authCheck) return $authCheck;

        // Calculate comprehensive stats
        $stats = [
            'total_events' => $this->eventModel->countAllResults(),
            'total_registrations' => $this->registrationModel->countAllResults(),
            'total_users' => $this->userModel->countAllResults(),
            'total_certificates' => 0, // Placeholder
            'events_growth' => 12.5, // Placeholder - calculate actual growth
            'registrations_growth' => 8.3, // Placeholder - calculate actual growth
            'users_growth' => 15.2, // Placeholder - calculate actual growth
            'certificates_growth' => 5.7 // Placeholder - calculate actual growth
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `events`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL

        }

        // Event type distribution
        $eventTypeData = $this->eventModel
            ->select('type as event_type, COUNT(*) as count')
            ->groupBy('type')
            ->findAll();
---
SELECT `type` as `event_type`, COUNT(*) as count
FROM `events`
GROUP BY `type`

        }

        // Top events by registration count
        $top_events = $this->eventModel
            ->select('events.id, events.title, events.type, COUNT(event_registrations.id) as participants')
            ->join('event_registrations', 'event_registrations.event_id = events.id', 'left')
            ->groupBy('events.id')
            ->orderBy('participants', 'DESC')
            ->limit(5)
            ->findAll();

        // Recent activities
        $recent_activities = $this->registrationModel
            ->select('event_registrations.created_at, users.full_name as user_name, events.title as event_title')
            ->join('users', 'users.id = event_registrations.user_id')
            ->join('events', 'events.id = event_registrations.event_id')
            ->orderBy('event_registrations.created_at', 'DESC')
            ->limit(10)
            ->findAll();

        // Revenue summary
        $totalRevenue = $this->registrationModel
            ->selectSum('events.price', 'total')
            ->join('events', 'events.id = event_registrations.event_id')
            ->where('event_registrations.payment_status', 'paid')
            ->first()['total'] ?? 0;

        $monthlyRevenue = $this->registrationModel
            ->selectSum('events.price', 'total')
            ->join('events', 'events.id = event_registrations.event_id')
            ->where('event_registrations.payment_status', 'paid')
            ->where("DATE_FORMAT(event_registrations.created_at, '%Y-%m')", date('Y-m'))
            ->first()['total'] ?? 0;

        $paidEventsCount = $this->eventModel->where('price >', 0)->countAllResults();
        $freeEventsCount = $this->eventModel->where('price', 0)->countAllResults();
---
SELECT `events`.`id`, `events`.`title`, `events`.`type`, COUNT(event_registrations.id) as participants
FROM `events`
LEFT JOIN `event_registrations` ON `event_registrations`.`event_id` = `events`.`id`
GROUP BY `events`.`id`
ORDER BY `participants` DESC
 LIMIT 5
SELECT `event_registrations`.`created_at`, `users`.`full_name` as `user_name`, `events`.`title` as `event_title`
FROM `event_registrations`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
ORDER BY `event_registrations`.`created_at` DESC
 LIMIT 10
SELECT SUM(`events`.`price`) AS `total`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
WHERE `event_registrations`.`payment_status` = 'paid'
 LIMIT 1
SELECT SUM(`events`.`price`) AS `total`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
WHERE `event_registrations`.`payment_status` = 'paid'
AND DATE_FORMAT(event_registrations.created_at, '%Y-%m') = '2025-07'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `price` > 0
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `price` = 0

    public function eventRegistrations($eventId)
    {
        $authCheck = $this->checkAdminAuth();
        if ($authCheck) return $authCheck;

        $event = $this->eventModel->find($eventId);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '10'