app/Controllers/UserController.php

    public function registerEvent($eventId)
    {
        $authCheck = $this->checkUserAuth();
        if ($authCheck) return $authCheck;

        $userId = session()->get('user_id');

        // Check if event exists and is published
        $event = $this->eventModel->find($eventId);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '4'

    public function cancelRegistration($registrationId)
    {
        // Enhanced debug logging
        log_message('info', 'Cancel registration called with ID: ' . $registrationId);
        log_message('info', 'Request method: ' . $this->request->getMethod());
        log_message('info', 'Request URI: ' . $this->request->getUri());
        log_message('info', 'POST data: ' . json_encode($this->request->getPost()));

        $authCheck = $this->checkUserAuth();
        if ($authCheck) return $authCheck;

        $userId = session()->get('user_id');
        log_message('info', 'User ID: ' . $userId);

        $registration = $this->registrationModel->find($registrationId);
        log_message('info', 'Registration found: ' . ($registration ? 'Yes' : 'No'));

        if (!$registration || $registration['user_id'] != $userId) {
            log_message('error', 'Registration not found or user mismatch');
            return redirect()->to('/user/my-events')->with('error', 'Pendaftaran tidak ditemukan.');
        }

        // Check if already cancelled
        if ($registration['status'] === 'cancelled') {
            return redirect()->back()->with('error', 'Pendaftaran sudah dibatalkan sebelumnya.');
        }

        $event = $this->eventModel->find($registration['event_id']);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '4'