app/Models/EventModel.php

SELECT `events`.*, `users`.`full_name` as `creator_name`
FROM `events`
JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`status` = 'published'
AND `events`.`start_date` > '2025-07-13 16:12:14'
ORDER BY `events`.`start_date` ASC
---
    public function getPublishedEvents()
    {
        return $this->select('events.*, users.full_name as creator_name')
                    ->join('users', 'users.id = events.created_by')
                    ->where('events.status', 'published')
                    ->where('events.start_date >', date('Y-m-d H:i:s'))
                    ->orderBy('events.start_date', 'ASC')
                    ->findAll();

SELECT *
FROM `events`
WHERE `status` = 'published'
AND `start_date` > '2025-07-16 04:21:24'
ORDER BY `start_date` ASC
 LIMIT 6
---
    public function getUpcomingEvents($limit = 5)
    {
        return $this->where('status', 'published')
                    ->where('start_date >', date('Y-m-d H:i:s'))
                    ->orderBy('start_date', 'ASC')
                    ->limit($limit)
                    ->findAll();

SELECT `events`.*, `users`.`full_name` as `creator_name`, `users`.`email` as `creator_email`
FROM `events`
JOIN `users` ON `users`.`id` = `events`.`created_by`
WHERE `events`.`id` = '4'
 LIMIT 1
---
    public function getEventWithCreator($id)
    {
        return $this->select('events.*, users.full_name as creator_name, users.email as creator_email')
                    ->join('users', 'users.id = events.created_by')
                    ->where('events.id', $id)
                    ->first();

SELECT COUNT(*) AS `numrows` FROM `events`
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `status` = 'published'
AND `start_date` > '2025-07-13 16:12:53'
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `status` = 'completed'
---
    public function getEventStats()
    {
        $stats = [];
        $stats['total_events'] = $this->countAll();
        $stats['published_events'] = $this->where('status', 'published')->countAllResults();
        $stats['upcoming_events'] = $this->where('status', 'published')
                                         ->where('start_date >', date('Y-m-d H:i:s'))
                                         ->countAllResults();
        $stats['completed_events'] = $this->where('status', 'completed')->countAllResults();

SELECT *
FROM `events`
WHERE `events`.`id` = '4'
UPDATE `events` SET `current_participants` = 1, `updated_at` = '2025-07-13 17:39:46'
WHERE `events`.`id` IN ('4')
---
    public function incrementParticipants($eventId)
    {
        $event = $this->find($eventId);
        if ($event) {
            $this->update($eventId, [
                'current_participants' => $event['current_participants'] + 1
            ]);

SELECT *
FROM `events`
WHERE `events`.`id` = '4'
UPDATE `events` SET `current_participants` = 0, `updated_at` = '2025-07-13 17:41:53'
WHERE `events`.`id` IN ('4')
---
    public function decrementParticipants($eventId)
    {
        $event = $this->find($eventId);
        if ($event && $event['current_participants'] > 0) {
            $this->update($eventId, [
                'current_participants' => $event['current_participants'] - 1
            ]);