app/Models/EventRegistrationModel.php

SELECT COUNT(*) AS `numrows` FROM `event_registrations`
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'registered'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'attended'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'cancelled'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `certificate_issued` = 1
---
    public function getRegistrationStats()
    {
        $stats = [];
        $stats['total_registrations'] = $this->countAll();
        $stats['active_registrations'] = $this->where('status', 'registered')->countAllResults();
        $stats['attended'] = $this->where('status', 'attended')->countAllResults();
        $stats['cancelled'] = $this->where('status', 'cancelled')->countAllResults();
        $stats['certificates_issued'] = $this->where('certificate_issued', true)->countAllResults();