app/Models/EventRegistrationModel.php

SELECT `event_registrations`.*, `events`.`title` as `event_title`, `events`.`type` as `event_type`, `events`.`start_date` as `event_start_date`, `events`.`end_date` as `event_end_date`, `events`.`location` as `event_location`, `events`.`speaker` as `event_speaker`, `events`.`description` as `event_description`, `events`.`price` as `event_price`, `events`.`image` as `event_image`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
WHERE `event_registrations`.`user_id` = '9'
ORDER BY `event_registrations`.`registration_date` DESC
---
    public function getUserRegistrations($userId)
    {
        return $this->select('event_registrations.*,
                             events.title as event_title,
                             events.type as event_type,
                             events.start_date as event_start_date,
                             events.end_date as event_end_date,
                             events.location as event_location,
                             events.speaker as event_speaker,
                             events.description as event_description,
                             events.price as event_price,
                             events.image as event_image')
                    ->join('events', 'events.id = event_registrations.event_id')
                    ->where('event_registrations.user_id', $userId)
                    ->orderBy('event_registrations.registration_date', 'DESC')
                    ->findAll();

SELECT `event_registrations`.*, `users`.`full_name`, `users`.`email`, `users`.`phone`, `users`.`username`
FROM `event_registrations`
JOIN `users` ON `users`.`id` = `event_registrations`.`user_id`
WHERE `event_registrations`.`event_id` = '10'
ORDER BY `event_registrations`.`registration_date` ASC
---
    public function getEventRegistrations($eventId)
    {
        return $this->select('event_registrations.*, users.full_name, users.email, users.phone, users.username')
                    ->join('users', 'users.id = event_registrations.user_id')
                    ->where('event_registrations.event_id', $eventId)
                    ->orderBy('event_registrations.registration_date', 'ASC')
                    ->findAll();

SELECT *
FROM `event_registrations`
WHERE `event_id` = '4'
AND `user_id` = '2'
 LIMIT 1
---
    public function isUserRegistered($eventId, $userId)
    {
        $registration = $this->where('event_id', $eventId)
                    ->where('user_id', $userId)
                    ->first();

SELECT *
FROM `event_registrations`
WHERE `event_id` = '4'
AND `user_id` = '2'
 LIMIT 1
---
    public function getUserRegistration($eventId, $userId)
    {
        return $this->where('event_id', $eventId)
                    ->where('user_id', $userId)
                    ->first();

SELECT COUNT(*) AS `numrows` FROM `event_registrations`
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'registered'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'attended'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `status` = 'cancelled'
SELECT COUNT(*) AS `numrows`
FROM `event_registrations`
WHERE `certificate_issued` = 1
---
    public function getRegistrationStats()
    {
        $stats = [];
        $stats['total_registrations'] = $this->countAll();
        $stats['active_registrations'] = $this->where('status', 'registered')->countAllResults();
        $stats['attended'] = $this->where('status', 'attended')->countAllResults();
        $stats['cancelled'] = $this->where('status', 'cancelled')->countAllResults();
        $stats['certificates_issued'] = $this->where('certificate_issued', true)->countAllResults();