app/Models/UserModel.php

    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@eventra.id'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function getUserStats()
    {
        $total = $this->countAllResults(false);
        $active = $this->where('is_active', 1)->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `is_active` = 1
AND `is_active` = 0
AND `created_at` >= '2025-06-13 16:21:33'